# Project: League of Legends

League of Legends players all think that they know everything about the game, but the truth is that most of the playerbase has no deeper understanding of the game.

In this project, I will use data analysis to prove with empirical statistics that there is a great disparity between the tiers of characters who players think are good, and the characters that are actually good.

In [1]:
%load_ext sql
import os
import configparser
import pandas as pd
from sqlalchemy import create_engine
import sqlalchemy.sql

In [2]:
mysqlcfg = configparser.ConfigParser()
mysqlcfg.read("/home/jovyan/CS-3287/mysql.cfg")
dburl = mysqlcfg['mysql']['url']

os.environ['DATABASE_URL'] = dburl  # define this env. var for sqlmagic
eng = create_engine(dburl)
conn = eng.connect()

In [3]:
%reload_ext sql
print ("get version...")
%sql SELECT version()

get version...
1 rows affected.

[('8.0.33',)]

## Table Creation

Dropped all tables if they exist in order to cleanly create the database.  Created functions to convert the csv files to pandas dataframes, then convert those to sql databases.  The stats table required data cleaning because null values needed to be changed to 0 and the file was so large that it had to be added in chunks.

In [4]:
%%sql
DROP TABLE IF EXISTS stats;
DROP TABLE IF EXISTS teamstats;
DROP TABLE IF EXISTS teambans;
DROP TABLE IF EXISTS participants;
DROP TABLE IF EXISTS matches;
DROP TABLE IF EXISTS champs;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [5]:
def convertSQL(table):
    # Read the CSV file into a pandas DataFrame
    csv_file_path = table + '.csv'
    df = pd.read_csv(csv_file_path)

    # Write the DataFrame to an SQL table
    table_name = table
    df.to_sql(table_name, conn, index=False, if_exists='fail')

In [6]:
tables = [
    'champs',
    'matches',
    'participants',
    'teambans',
    'teamstats'
]

for t in tables:
    try:
        convertSQL(t)
    except ValueError:
        print("table", t, "exists")

In [7]:
def convertBig(table):
    chunk_size = 10000
    csv_file_path = table + '.csv'

    for chunk in pd.read_csv(csv_file_path, chunksize = chunk_size):
        chunk.replace('\\N', 0, inplace=True)
        chunk.to_sql('stats', conn, if_exists='append', index=False)

In [8]:
convertBig('stats1')

In [9]:
convertBig('stats2')

## Constraints

Added constraints to every table in order to set the primary and foreign keys.

In [10]:
%%sql
ALTER TABLE champs
ADD CONSTRAINT PRIMARY KEY (id);

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
0 rows affected.

[]

In [11]:
%%sql
ALTER TABLE matches
ADD CONSTRAINT PRIMARY KEY (id);

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
0 rows affected.

[]

In [12]:
%%sql
ALTER TABLE participants
ADD CONSTRAINT PRIMARY KEY (id);

ALTER TABLE participants
ADD CONSTRAINT 
FOREIGN KEY (matchid) 
REFERENCES matches(id);

ALTER TABLE participants
ADD CONSTRAINT 
FOREIGN KEY (championid) 
REFERENCES champs(id);

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
0 rows affected.
1834520 rows affected.
1834520 rows affected.

[]

In [13]:
%%sql
ALTER TABLE teambans
ADD CONSTRAINT 
FOREIGN KEY (matchid) 
REFERENCES matches(id);

ALTER TABLE teambans
ADD CONSTRAINT 
FOREIGN KEY (championid) 
REFERENCES champs(id);

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
1099185 rows affected.
1099185 rows affected.

[]

In [14]:
%%sql
ALTER TABLE teamstats
ADD CONSTRAINT 
FOREIGN KEY (matchid) 
REFERENCES matches(id);

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
368138 rows affected.

[]

In [15]:
%%sql
ALTER TABLE stats
ADD CONSTRAINT 
FOREIGN KEY (id) 
REFERENCES participants(id);

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
1834517 rows affected.

[]

## Triggers

Triggers were created to handle illegal insertions and cascading deletions.

In [16]:
%%sql
CREATE TRIGGER insert_participants
BEFORE INSERT
ON participants FOR EACH ROW

BEGIN
    IF EXISTS (
        SELECT 1
        FROM teambans
        WHERE championid = NEW.championid 
        AND matchid = NEW.matchid
    ) 
    
    THEN
        SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'Cannot insert into participants. Champion already banned for this match.';
    END IF;
END;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
0 rows affected.

[]

In [17]:
%%sql
CREATE TRIGGER delete_participants
BEFORE DELETE
ON matches
FOR EACH ROW
BEGIN
    DELETE FROM participants
    WHERE matchid = OLD.id;
END;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
0 rows affected.

[]

In [18]:
%%sql
CREATE TRIGGER delete_champs
BEFORE DELETE
ON champs
FOR EACH ROW
BEGIN
    DELETE FROM participants
    WHERE championid = OLD.id;
END;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
0 rows affected.

[]

In [19]:
%%sql
CREATE TRIGGER delete_matches
BEFORE DELETE
ON matches
FOR EACH ROW
BEGIN
    DELETE FROM teambans
    WHERE matchid = OLD.id;
END;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
0 rows affected.

[]

In [20]:
%%sql
CREATE TRIGGER delete_teambans
BEFORE DELETE
ON champs
FOR EACH ROW
BEGIN
    DELETE FROM teambans
    WHERE championid = OLD.id;
END;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
0 rows affected.

[]

In [21]:
%%sql
CREATE TRIGGER delete_teamstats
BEFORE DELETE
ON matches
FOR EACH ROW
BEGIN
    DELETE FROM teamstats
    WHERE matchid = OLD.id;
END;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
0 rows affected.

[]

In [22]:
%%sql
CREATE TRIGGER delete_stats
BEFORE DELETE
ON participants
FOR EACH ROW
BEGIN
    DELETE FROM stats
    WHERE id = OLD.id;
END;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
0 rows affected.

[]

## Indexes

Created indexes on each table to improve runtimes of search queries.

In [23]:
%%sql
CREATE INDEX idx_champs_name
ON champs (name(255));

CREATE INDEX idx_matches_gameid
ON matches (gameid);

CREATE INDEX idx_participants_championid
ON participants (championid);

CREATE INDEX idx_teambans_championid
ON teambans (championid);

CREATE INDEX idx_teamstats_teamid
ON teamstats (teamid);

CREATE INDEX idx_stats_id
ON stats (id);

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

## Queries

Selected first 5 rows of each table to print sample content from the database.

In [24]:
%%sql
SELECT *
FROM champs
LIMIT 5;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
5 rows affected.

[('Annie', 1), ('Olaf', 2), ('Galio', 3), ('Twisted Fate', 4), ('Xin Zhao', 5)]

In [25]:
%%sql
SELECT *
FROM matches
LIMIT 5;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
5 rows affected.

[(10, 3187427022, 'EUW1', 420, 8, 1909, 1495068946860, '7.10.187.9675'),
 (11, 3187425281, 'EUW1', 420, 8, 1693, 1495066760778, '7.10.187.9675'),
 (12, 3187269801, 'EUW1', 420, 8, 1482, 1495053375889, '7.10.187.9675'),
 (13, 3187252065, 'EUW1', 420, 8, 1954, 1495050993613, '7.10.187.9675'),
 (14, 3187201038, 'EUW1', 420, 8, 2067, 1495047893400, '7.10.187.9675')]

In [26]:
%%sql
SELECT *
FROM participants
LIMIT 5;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
5 rows affected.

[(9, 10, 1, 19, 4, 11, 'NONE', 'JUNGLE'),
 (10, 10, 2, 267, 3, 4, 'DUO_SUPPORT', 'BOT'),
 (11, 10, 3, 119, 7, 4, 'DUO_CARRY', 'BOT'),
 (12, 10, 4, 114, 12, 4, 'SOLO', 'TOP'),
 (13, 10, 5, 112, 4, 3, 'SOLO', 'MID')]

In [27]:
%%sql
SELECT *
FROM teambans
LIMIT 5;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
5 rows affected.

[(10, 100, 11, 1),
 (10, 100, 117, 3),
 (10, 100, 120, 5),
 (10, 200, 84, 2),
 (10, 200, 201, 4)]

In [28]:
%%sql
SELECT *
FROM teamstats
LIMIT 5;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
5 rows affected.

[(10, 100, 0, 1, 0, 0, 0, 0, 5, 0, 0, 0, 0),
 (10, 200, 1, 0, 1, 1, 1, 1, 10, 3, 1, 3, 1),
 (11, 100, 1, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0),
 (11, 200, 0, 1, 1, 0, 1, 0, 10, 3, 0, 2, 0),
 (12, 100, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0)]

In [29]:
%%sql
SELECT *
FROM stats
LIMIT 5;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
5 rows affected.

[(9, 0, 3748, 2003, 3111, 3053, 1419, 1042, 3340, 6, 10, 1, 2, 2, 2, 643, 2, 0, 0, 0, 0, 96980, 25154, 65433, 6392, 0, 9101, 3975, 4237, 888, 15160, 1, 23998, 1826, 1170, 14, 0, 41446, 13270, 24957, 3218, 10497, 10275, 0, 0, 42, 69, 42, 27, 610, 13, 0, 0, 10, 0, 0),
 (10, 0, 2301, 3111, 3190, 3107, 0, 0, 3364, 0, 2, 12, 0, 0, 0, 1116, 0, 0, 0, 0, 0, 25995, 17633, 6295, 2066, 0, 8478, 6684, 977, 816, 11707, 5, 9402, 1943, 1852, 30, 0, 17769, 7945, 7688, 2136, 9496, 7975, 1, 0, 17, 1, 1, 0, 211, 14, 1, 0, 17, 3, 0),
 (11, 0, 1055, 3072, 3006, 3031, 3046, 1036, 3340, 7, 8, 5, 5, 2, 1, 584, 2, 0, 0, 0, 0, 171568, 1725, 169576, 266, 1042, 14425, 331, 14070, 24, 2283, 2, 16612, 5094, 2128, 26, 0, 25627, 12538, 11094, 1993, 13136, 11775, 0, 0, 205, 3, 1, 2, 182, 14, 1, 0, 13, 5, 0),
 (12, 0, 1029, 3078, 3156, 1001, 3053, 0, 3340, 5, 11, 2, 2, 1, 1, 300, 0, 0, 0, 0, 0, 113721, 989, 109563, 3168, 455, 15267, 296, 11802, 3168, 4252, 1, 27174, 8263, 8263, 5, 0, 31705, 10280, 19506, 1918, 11006, 10683, 3, 0, 164, 6, 6, 0, 106, 15, 0, 0, 3, 0, 0),
 (13, 0, 3020, 1058, 3198, 3102, 1052, 1026, 3340, 2, 8, 2, 0, 1, 0, 504, 0, 0, 0, 0, 0, 185302, 166671, 16867, 1763, 0, 18229, 17925, 28, 275, 1525, 1, 14616, 3801, 1724, 15, 0, 20585, 6850, 11119, 2615, 11439, 10485, 1, 0, 235, 4, 3, 1, 159, 15, 0, 0, 10, 0, 0)]

## Picks Bans and Win Rates

Selected joins between tables to calculate how often champions were picked or banned versus their winning percentages.

In [30]:
%%sql
SELECT 
    champs.name, 
    COUNT(participants.championid) AS pick_rate

FROM champs

JOIN participants 
ON champs.id = participants.championid

GROUP BY champs.name
ORDER BY pick_rate DESC
LIMIT 5;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
5 rows affected.

[('Lee Sin', 59286),
 ('Caitlyn', 57275),
 ('Lucian', 56676),
 ('Thresh', 48877),
 ('Ahri', 37424)]

In [31]:
%%sql
SELECT 
    champs.name, 
    SUM(stats.win) AS total_wins

FROM champs

JOIN participants 
ON champs.id = participants.championid

JOIN stats 
ON participants.id = stats.id

GROUP BY champs.name
ORDER BY total_wins DESC
LIMIT 5;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
5 rows affected.

[('Caitlyn', Decimal('29186')),
 ('Lee Sin', Decimal('28732')),
 ('Lucian', Decimal('28556')),
 ('Thresh', Decimal('24600')),
 ('Ahri', Decimal('19949'))]

As we can see from the 2 tables above, win totals are not a good statistic to measure the effectiveness of a character, because there's too strong a correlation between pick rate and total wins.

In [32]:
%%sql
SELECT
    champ_stats.name,
    champ_stats.total_wins,
    champ_stats.pick_rate,
    
    IF (
        champ_stats.pick_rate > 0, 
        champ_stats.total_wins / champ_stats.pick_rate, 0
    ) AS win_rate

FROM (
    SELECT
        champs.name,
        COUNT(participants.championid) AS pick_rate,
        SUM(stats.win) AS total_wins
    
    FROM champs
    
    JOIN participants 
    ON champs.id = participants.championid
    
    JOIN stats 
    ON participants.id = stats.id
    
    GROUP BY champs.name
) AS champ_stats

ORDER BY win_rate DESC
LIMIT 5;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
5 rows affected.

[('Ivern', Decimal('4578'), 8194, Decimal('0.5587')),
 ('Anivia', Decimal('4194'), 7785, Decimal('0.5387')),
 ('Xerath', Decimal('3357'), 6273, Decimal('0.5352')),
 ('Sona', Decimal('7529'), 14090, Decimal('0.5344')),
 ('Ahri', Decimal('19949'), 37423, Decimal('0.5331'))]

The top 5 champions in terms of win rates are not in the top 5 most picked list, with the exception of Ahri.  This discrepancy between a character's popularity and its actual winning percentage demonstrates the playerbase's lack of judgement in terms of champion selection.

In [33]:
%%sql
SELECT 
    champs.name, 
    COUNT(teambans.championid) AS champion_bans

FROM champs

LEFT JOIN teambans 
ON champs.id = teambans.championid

GROUP BY champs.name
ORDER BY champion_bans DESC
LIMIT 5;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
5 rows affected.

[('Yasuo', 97862),
 ('Fizz', 81525),
 ('Xayah', 77293),
 ('Lulu', 75421),
 ('Darius', 58799)]

None of the most banned champions are ranked in the top 5 win rates.  Results from the picks, bans, and win rates queries were grouped by transforming them into pandas dataframes, and then merging them into a single table.

In [34]:
query = """
SELECT 
    champs.name, 
    COUNT(teambans.championid) AS champion_bans

FROM champs

LEFT JOIN teambans 
ON champs.id = teambans.championid

GROUP BY champs.name
ORDER BY champion_bans DESC;
"""

bans = pd.read_sql_query(query, conn)

query = """
SELECT
    champ_stats.name,
    champ_stats.pick_rate,
    
    IF(
        champ_stats.pick_rate > 0, 
        champ_stats.total_wins / champ_stats.pick_rate, 0
    ) AS win_rate

FROM (
    SELECT
        champs.name,
        COUNT(participants.championid) AS pick_rate,
        SUM(stats.win) AS total_wins
        
    FROM champs
    
    JOIN participants 
    ON champs.id = participants.championid
    
    JOIN stats 
    ON participants.id = stats.id
    
    GROUP BY champs.name
) AS champ_stats

ORDER BY win_rate DESC;
"""

picks = pd.read_sql_query(query, conn)
picks_bans = pd.merge(picks, bans, on='name')
display(picks_bans)

       name  pick_rate  win_rate  champion_bans
0     Ivern       8194    0.5587          30356
1    Anivia       7785    0.5387           1310
2    Xerath       6273    0.5352            396
3      Sona      14090    0.5344            400
4      Ahri      37423    0.5331          20806
..      ...        ...       ...            ...
131   Rakan      21616    0.4601          18947
132  Rengar       8121    0.4563           5723
133  Ezreal      28397    0.4561           1036
134    Azir       3166    0.4394           1051
135    Ryze       5737    0.3965            886

[136 rows x 4 columns]

## KDA DPS and Gold Gen

Total stats in terms of kills, deaths, assists, damage per second, and gold generation are all skewed in favor of champions with high pick rates.

In [35]:
%%sql
SELECT
    champs.name,
    SUM(stats.kills) AS total_kills,
    SUM(stats.deaths) AS total_deaths,
    SUM(stats.assists) AS total_assists
    
FROM champs

JOIN participants 
ON champs.id = participants.championid

JOIN stats 
ON participants.id = stats.id

GROUP BY champs.name
ORDER BY total_kills DESC
LIMIT 5;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
5 rows affected.

[('Lucian', Decimal('408134'), Decimal('311890'), Decimal('393708')),
 ('Lee Sin', Decimal('385438'), Decimal('357481'), Decimal('491276')),
 ('Caitlyn', Decimal('362252'), Decimal('325952'), Decimal('417329')),
 ('Ahri', Decimal('264859'), Decimal('203289'), Decimal('281066')),
 ('Vayne', Decimal('263972'), Decimal('222935'), Decimal('203163'))]

In [36]:
%%sql
SELECT
    champs.name,
    SUM(stats.totdmgtochamp) AS total_champ_damage,
    SUM(stats.goldearned) AS total_gold_earned
    
FROM champs

JOIN participants 
ON champs.id = participants.championid

JOIN stats 
ON participants.id = stats.id

GROUP BY champs.name
ORDER BY total_champ_damage DESC
LIMIT 5;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
5 rows affected.

[('Caitlyn', Decimal('1263207504'), Decimal('710181924')),
 ('Lucian', Decimal('1207764265'), Decimal('706298955')),
 ('Ahri', Decimal('845094188'), Decimal('446536529')),
 ('Lee Sin', Decimal('823211648'), Decimal('662755248')),
 ('Vayne', Decimal('723287795'), Decimal('430940627'))]

Statistical averages are a better measure of champion performance than sum totals.  The top 5 champions in terms of kills are all melee assassins.  The top 5 damage dealers are all ranged DPS.

In [37]:
%%sql
SELECT
    champs.name,
    AVG(stats.kills) AS average_kills,
    AVG(stats.deaths) AS average_deaths,
    AVG(stats.assists) AS average_assists
    
FROM champs

JOIN participants 
ON champs.id = participants.championid

JOIN stats 
ON participants.id = stats.id

GROUP BY champs.name
ORDER BY average_kills DESC
LIMIT 5;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
5 rows affected.

[('Katarina', Decimal('9.6416'), Decimal('7.3008'), Decimal('5.8952')),
 ('Fizz', Decimal('8.8925'), Decimal('6.4693'), Decimal('5.7609')),
 ('Akali', Decimal('8.8488'), Decimal('6.9301'), Decimal('5.3686')),
 ('Talon', Decimal('8.7352'), Decimal('6.8353'), Decimal('6.1811')),
 ('Master Yi', Decimal('8.6458'), Decimal('6.9232'), Decimal('4.9100'))]

In [38]:
%%sql
SELECT
    champs.name,
    AVG(stats.totdmgtochamp) AS average_champ_damage,
    AVG(stats.goldearned) AS average_gold_earned
    
FROM champs

JOIN participants 
ON champs.id = participants.championid

JOIN stats 
ON participants.id = stats.id

GROUP BY champs.name
ORDER BY average_champ_damage DESC
LIMIT 5;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
5 rows affected.

[('Karthus', Decimal('29989.7830'), Decimal('12686.0855')),
 ('Ziggs', Decimal('26358.6579'), Decimal('12238.3940')),
 ('Teemo', Decimal('26218.6762'), Decimal('12089.0831')),
 ('Xerath', Decimal('26060.0104'), Decimal('12077.0064')),
 ('KogMaw', Decimal('25714.1777'), Decimal('12590.1123'))]

In [39]:
%%sql
DROP VIEW IF EXISTS champion_stats_view;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
0 rows affected.

[]

In [40]:
%%sql
CREATE VIEW champion_stats_view AS

SELECT
    champs.name,
    AVG(stats.totdmgdealt) AS average_damage_dealt,
    AVG(stats.goldearned) AS average_gold_earned
    
FROM champs

JOIN participants 
ON champs.id = participants.championid

JOIN stats 
ON participants.id = stats.id

GROUP BY champs.name;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
0 rows affected.

[]

Total damage dealt proved to be the best predictor of gold generation.  Draven and Karthus are the 2 exceptions due to gold earning strategies unique to them.  Draven's passive allows him to cash in bounties through champion kills.  Karthus's ultimate combined with First Strike allows him to generate gold by repeatedly dealing global damage to enemy champions.

In [41]:
%%sql
SELECT *
FROM champion_stats_view
ORDER BY average_damage_dealt DESC
LIMIT 5;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
5 rows affected.

[('Ivern', Decimal('326155.9985'), Decimal('10147.7485')),
 ('Gangplank', Decimal('210427.3601'), Decimal('13521.6733')),
 ('Tryndamere', Decimal('177082.4474'), Decimal('12649.1705')),
 ('Sivir', Decimal('169686.6662'), Decimal('12727.6721')),
 ('Master Yi', Decimal('165650.6553'), Decimal('12551.1966'))]

In [42]:
%%sql
SELECT *
FROM champion_stats_view
ORDER BY average_gold_earned DESC
LIMIT 5;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
5 rows affected.

[('Gangplank', Decimal('210427.3601'), Decimal('13521.6733')),
 ('Draven', Decimal('148793.4079'), Decimal('13286.6840')),
 ('Sivir', Decimal('169686.6662'), Decimal('12727.6721')),
 ('Karthus', Decimal('151966.9471'), Decimal('12686.0855')),
 ('Tryndamere', Decimal('177082.4474'), Decimal('12649.1705'))]

## Trigger Testing

The illegal insertion trigger is tested by attempting to insert a champion into a match in which that champion is already banned.

In [43]:
try:
    result = %sql INSERT INTO participants (matchid, championid) VALUES (10, 11);
    print(result)
except Exception as err:
    print("Error", err)

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
(MySQLdb.OperationalError) (1644, 'Cannot insert into participants. Champion already banned for this match.')
[SQL: INSERT INTO participants (matchid, championid) VALUES (10, 11);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)
None

In [44]:
%%sql
SELECT *
FROM champs
WHERE name = 'Teemo';

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
1 rows affected.

[('Teemo', 17)]

The cascading delete triggers were all tested by removing the character Teemo from the game.

In [45]:
%%sql
SELECT COUNT(*) AS teemo_count
FROM participants
WHERE championid = 17;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
1 rows affected.

[(14807,)]

In [46]:
%%sql
SELECT COUNT(*) AS stats_rows
FROM stats;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
1 rows affected.

[(1834517,)]

In [47]:
%%sql
DELETE FROM champs
WHERE id = 17;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
1 rows affected.

[]

Following deletion, the number of participants playing Teemo was reduced to 0.  The difference between the row count of the stats table before and after deletion is equal to the number of Teemo players who were removed.

In [48]:
%%sql
SELECT COUNT(*) AS teemo_count
FROM participants
WHERE championid = 17;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
1 rows affected.

[(0,)]

In [49]:
%%sql
SELECT COUNT(*) AS stats_rows
FROM stats;

 * mysql://mibu4178:***@applied-sql.cs.colorado.edu:3306/mibu4178
1 rows affected.

[(1819710,)]

In [50]:
1834517 - 1819710

14807